In [3]:
import pandas as pd

data1 = {
    'StudentID': [101, 102, 103],
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Marks': [85, 90, 88]
}

In [5]:
students = pd.DataFrame(data1)

In [7]:
students

   StudentID     Name  Marks
0        101    Alice     85
1        102      Bob     90
2        103  Charlie     88

In [9]:
data2 = {
    'StudentID': [101, 103, 104],
    'Age': [20, 22, 19],
    'Grade': ['A', 'A', 'B']
}

In [11]:
details = pd.DataFrame(data2)

In [13]:
details

   StudentID  Age Grade
0        101   20     A
1        103   22     A
2        104   19     B

In [15]:
merged_df=pd.merge(students,details,on='StudentID', how='inner')

In [17]:
merged_df

   StudentID     Name  Marks  Age Grade
0        101    Alice     85   20     A
1        103  Charlie     88   22     A

In [19]:
merged_df1=pd.merge(students,details,on='StudentID', how='left')

In [21]:
merged_df1

   StudentID     Name  Marks   Age Grade
0        101    Alice     85  20.0     A
1        102      Bob     90   NaN   NaN
2        103  Charlie     88  22.0     A

In [23]:
merged_df2=pd.merge(students,details,on='StudentID', how='right')

In [25]:
merged_df2

   StudentID     Name  Marks  Age Grade
0        101    Alice   85.0   20     A
1        103  Charlie   88.0   22     A
2        104      NaN    NaN   19     B

In [27]:
merged_df3=pd.merge(students,details,on='StudentID', how='outer')

In [29]:
merged_df3

   StudentID     Name  Marks   Age Grade
0        101    Alice   85.0  20.0     A
1        102      Bob   90.0   NaN   NaN
2        103  Charlie   88.0  22.0     A
3        104      NaN    NaN  19.0     B